---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFNonUniformScalingTransform
source: html/20ac0edb-b4da-951b-db57-a1ce2c2fa59b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFNonUniformScalingTransform Property

The imported geometry contains non-uniform scaling transformations which Revit does not support. Some objects may be displaced or distorted.

## Syntax (C#)
```csharp
public static FailureDefinitionId ATFNonUniformScalingTransform { get; }
```